_posts/2015-05-18-Global-CTags-and-Emacs.html
---
layout : post
title : Global CTags and Emacs
categories : Emacs
tags : global ctags emacs
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Global</a>
<ul>
<li><a href="#sec-1-1">1.1. Gnu Global &amp; C++</a></li>
<li><a href="#sec-1-2">1.2. Global, Ctags &amp; pygments</a></li>
<li><a href="#sec-1-3">1.3. Global 配置文件</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Global &amp; Emacs</a></li>
</ul>
</div>
</div>
<p>
工作交接得差不多了，这几天比较闲，又折腾了几天的 Emacs 和 <a href="http://www.gnu.org/software/global/global.html">Gnu Global</a> ，解决了几个以前一直存在、但没时间折腾的问题，这里简单做个记录。
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Global</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Gnu Global &amp; C++</h3>
<div class="outline-text-3" id="text-1-1">
<p>
之前在工作中发现 global 貌似不能正确的解析 C++ 的命名空间 (namespace) 。比如：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span><span style="color: #ff4040;">namespace</span> <span style="color: #7fffd4; font-weight: bold;">Test</span>
<span class="linenr"> 2: </span>{
<span class="linenr"> 3: </span><span style="color: #ff4040;">class</span> <span style="color: #32cd32;">TestObject</span>
<span class="linenr"> 4: </span>{
<span class="linenr"> 5: </span><span style="color: #ff4040;">public</span>:
<span class="linenr"> 6: </span>    <span style="color: #1e90ff; font-weight: bold;">TestObject</span>()
<span class="linenr"> 7: </span>        : m_value(0) {}
<span class="linenr"> 8: </span>    <span style="color: #ff4040;">virtual</span> ~<span style="color: #1e90ff; font-weight: bold;">TestObject</span>() {}
<span class="linenr"> 9: </span>    <span style="color: #32cd32;">void</span> <span style="color: #1e90ff; font-weight: bold;">Show</span>() {}
<span class="linenr">10: </span><span style="color: #ff4040;">private</span>:
<span class="linenr">11: </span>    <span style="color: #32cd32;">int</span> <span style="color: #daa520;">m_value</span>;
<span class="linenr">12: </span>};
<span class="linenr">13: </span>}
</pre>
</div>

<p>
很简单的一个定义，但一旦将类的定义/实现放在了 <code>namespace</code> 里面，gtags 就解析不到这个符号。一直觉得这应该是个配置上的问题，后来终于发现，默认情况下，对 CPP &amp; H 文件，gtags
用的 Parser 居然是 C parser：
</p>

<blockquote>
<p>
<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> extracting tags of test.cpp
File './test.cpp' is handled as follows:
   suffix:   |.cpp|
   language: |cpp|
   parser:   |C|
   library:  |built-in|
</p>
</blockquote>

<p>
折腾了多次 global 的配置后，终于解决了这个问题，配置文件参见：<i>Global 配置文件</i>。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Global, Ctags &amp; pygments</h3>
<div class="outline-text-3" id="text-1-2">
<p>
global 本身支持多种语言的 TAG 的交叉查找，包括 c/c++, java, elisp, php 等等，此外还可以通过插件来支持其他的语言。
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> ctags</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Global 可以通过 ctags 来解析其他的语言，安装方法参考：<a href="https://github.com/leoliu/ggtags">https://github.com/leoliu/ggtags</a>
</p>

<blockquote>
<p>
Compile and install Global with exuberant-ctags
</p>

<p>
./configure &#x2013;prefix=&lt;PREFIX&gt; &#x2013;with-exuberant-ctags=/usr/local/bin/ctags
</p>

<p>
make &amp;&amp; make install
</p>

<p>
The executable ctags is unfortunately named because emacs also includes a command of the same name. So make sure it is from <a href="http://ctags.sourceforge.net">http://ctags.sourceforge.net</a>. See plugin-factory/README in GNU Global source for further information.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Pygments</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
新版 (6.4) 的 Global 内置了 pygments，用于从 python 文件中提取标签。
<a href="https://github.com/leoliu/ggtags">https://github.com/leoliu/ggtags</a> 上给出了 pygments 的手动安装方法：
</p>

<blockquote>
<p>
The pygments plugin has been included in global since version 6.3.2. pip install pygments is the only step required. Note the plugin is not activated by the default gtags.conf or .globalrc. See global/plugin-factory/PLUGIN_HOWTO.pygments for details.
</p>

<p>
The following instructions are for older global.
</p>

<p>
pip install pygments
</p>

<p>
git clone <a href="https://github.com/yoshizow/global-pygments-plugin.git">https://github.com/yoshizow/global-pygments-plugin.git</a>
</p>

<p>
cd global-pygments-plugin/
</p>

<p>
sh reconf.sh
</p>

<p>
./configure &#x2013;prefix=&lt;PREFIX&gt; &#x2013;with-exuberant-ctags=/usr/local/bin/ctags
</p>

<p>
make &amp;&amp; make install
</p>

<p>
cp sample.globalrc $HOME/.globalrc
</p>

<p>
Make sure the value of &lt;PREFIX&gt; agree with step 1.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> My gentoo overlay</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
<a href="https://github.com/yangyingchao/gentoo-overlay-tubo/blob/master/dev-util/global/global-6.4.ebuild">这里</a> 有一个 global 的 ebuild，已经添加了 ctags 和 pygments 的支持，Gentoo 和 Prefix 的用可以拿它来安装 global.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Global 配置文件</h3>
<div class="outline-text-3" id="text-1-3">
<p>
前面提到的 C++ 解析和 Ctags, pygments 都需要相应的配置文件。可惜的是，global 的配置文件文档不全，磕磕绊绊折腾了比较长的时间才弄好一份:
<a href="https://github.com/yangyingchao/tubo-env/blob/master/.globalrc_rc">https://github.com/yangyingchao/tubo-env/blob/master/.globalrc_rc</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Global &amp; Emacs</h2>
<div class="outline-text-2" id="text-2">
<p>
关于 global 和 Emacs 的整合，网络上已经有很多的教程和插件了，比如：
</p>

<ul class="org-ul">
<li><a href="https://github.com/leoliu/ggtags">https://github.com/leoliu/ggtags</a>
</li>
<li><a href="https://github.com/syohex/emacs-helm-gtags">https://github.com/syohex/emacs-helm-gtags</a>
</li>
<li><a href="http://emacswiki.org/emacs/GnuGlobal">http://emacswiki.org/emacs/GnuGlobal</a>
</li>
</ul>

<p>
自从从 <a href="https://github.com/dkogan/xcscope.el">cscope </a> 转到 global 之后， 我之前一直在用 <a href="http://www.emacswiki.org/emacs/xgtags.el">xgtags</a> ，用的很习惯。但前几天开始接触
<a href="https://github.com/emacs-helm/helm">helm</a> 之后，逐渐的习惯和喜欢上了 Helm 的这个交互式的操作，所以尝试了一段时间 <a href="https://github.com/syohex/emacs-helm-gtags">helm-gtags</a>，但习惯了 xgtags 的操作和界面，用 helm-gtags 总是感觉不习惯，而且 helm-gtags 里面加了很多个人感觉莫名其妙或者没什么大用的东西。所以花了几天时间把原来的 xgtags 做了修改。
</p>

<p>
修改后的 xgtags 和原来相比：
</p>

<ul class="org-ul">
<li>增加了通过 helm 来实现 Tag/file 的过滤
</li>
<li><code>xgtags-select-mode</code> 下可以触发 <code>helm-xgtags--activate</code> 。
</li>
<li><code>xgtags-parse-file</code> 下高亮并 preselect 当前函数。
</li>
</ul>

<p>
修改后的 xgtags 与 helm-ggtags 相比：
</p>

<ul class="org-ul">
<li>有更好的高亮显示
</li>
<li>可以通过 <code>xgtags-select-next-tag</code> / <code>xgtags-select-prev-tag</code> 直接选择之前或之后的tag
</li>
<li><code>xgtags-parse-file</code> 下高亮并 preselect 当前函数。
</li>
</ul>

<p>
感兴趣的 Emacser 可以从 <a href="https://github.com/yangyingchao/tubo-env/blob/master/.emacs.d/site-lisp/prog/xgtags.el">这里</a> 找到源码。</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div>